//推理题2
//5名运动员参加比赛,预测他们的成绩
//A：B第二,我第三
//B:我第二,E第四
//C:我第一,D第二
//D：C最后,我第三
//E:我第四,A第一
//比赛结束后,每人的预测都对了一半 
#include<stdio.h>
int main()
{
	int A=0,B=0,C=0,D=0,E=0;
	for(A=1;A<=5;A++)
	{
		for(B=1;B<=5;B++)
		{
			for(C=1;C<=5;C++)
			{
				for(D=1;D<=5;D++)
				{
					for(E=1;E<=5;E++)
					{
					   if(((B==2)+(A==3)==1)&&
					   ((B==2)+(E==4)==1)&&
					   ((C==1)+(D==2)==1)&&
					   ((C==5)+(D==3)==1)&&
					   ((E==4)+(A==1)==1)&&
					   (A*B*C*D*E==120))
					   {
					   	  printf("A第%d，B第%d,C第%d,D第%d,E第%d",A,B,C,D,E); 
					   }
					}
			    }
			}
		 } 
	 } 
	return 0;
 } 
